tap "hashicorp/tap"
tap "oven-sh/bun"
brew "go"
brew "jq"
brew "neovim"
brew "nvm"
brew "ripgrep"
brew "opencode"
brew "python@3.14"
brew "poetry"
brew "prettier"
brew "python@3.13"
brew "telnet"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "tree"
brew "uv"
brew "v2ray"
brew "wget"
brew "wireguard-tools"
brew "hashicorp/tap/terraform"
brew "oven-sh/bun/bun"
cask "claude-code"
cask "cloudflare-warp"
cask "dbeaver-community"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"
cask "google-chrome"
cask "keepassxc"
cask "obsidian"
cask "openvpn-connect"
cask "qqmusic"
cask "raycast"
cask "slack"
cask "sublime-text"
cask "trae-cn"
cask "visual-studio-code"
cask "wechat"
cask "wezterm"
vscode "alibaba-cloud.tongyi-lingma"
vscode "aminer.codegeex"
vscode "anthropic.claude-code"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
