tap "hashicorp/tap"
tap "oven-sh/bun"
brew "tree"
brew "ansible"
brew "cmake"
brew "dos2unix"
brew "gcc"
brew "go"
brew "httpie", link: false
brew "jq"
brew "libfido2"
brew "libidn2"
brew "libpq"
brew "lima"
brew "maven"
brew "mysql-client@8.0"
brew "neovim"
brew "node"
brew "openjdk@21"
brew "poetry"
brew "prettier"
brew "python@3.10"
brew "ripgrep"
brew "telnet"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "v2ray"
brew "watch"
brew "wget"
brew "wireguard-tools"
brew "hashicorp/tap/terraform"
brew "oven-sh/bun/bun"
cask "claude"
cask "cloudflare-warp"
cask "container"
cask "cursor"
cask "dbeaver-community"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"
cask "google-chrome"
cask "httpie-desktop"
cask "iterm2"
cask "keepassxc"
cask "lark"
cask "obsidian"
cask "outline-manager"
cask "raycast"
cask "slack"
cask "sublime-text"
cask "telegram"
cask "visual-studio-code"
cask "wechat"
cask "wezterm"
cask "whatsapp"
cask "windsurf"
cask "zoom"
vscode "anthropic.claude-code"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.makefile-tools"
vscode "redhat.java"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "vue.volar"
