tap "anomalyco/tap"
tap "hashicorp/tap"
tap "oven-sh/bun"
brew "tree"
brew "ansible"
brew "fzf"
brew "gh"
brew "go"
brew "helm"
brew "kubernetes-cli"
brew "tree-sitter"
brew "neovim"
brew "nvm"
brew "python@3.13"
brew "rclone"
brew "ripgrep"
brew "rtk"
brew "sing-box"
brew "tmux"
brew "tree-sitter-cli"
brew "uv"
brew "wget"
brew "wireguard-tools"
brew "xray"
brew "yq"
brew "anomalyco/tap/opencode"
brew "hashicorp/tap/terraform"
brew "oven-sh/bun/bun"
cask "clash-verge-rev"
cask "claude-code"
cask "cloudflare-warp"
cask "codex"
cask "cursor"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "keepassxc"
cask "obsidian"
cask "qqmusic"
cask "raycast"
cask "visual-studio-code"
cask "wechat"
cask "wezterm"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
