tap "hashicorp/tap"
tap "oven-sh/bun"
brew "python@3.14"
brew "tree"
brew "ansible"
brew "argocd"
brew "cmake"
brew "crane"
brew "dos2unix"
brew "gcc"
brew "gemini-cli"
brew "gh"
brew "go"
brew "helm"
brew "httpie", link: false
brew "kubernetes-cli"
brew "libfido2"
brew "libidn2"
brew "libpq"
brew "maven"
brew "mysql-client@8.0"
brew "tree-sitter"
brew "neovim"
brew "nvm"
brew "ripgrep"
brew "opencode"
brew "prettier"
brew "shellcheck"
brew "telnet"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "uv"
brew "v2ray"
brew "watch"
brew "wget"
brew "wireguard-tools"
brew "hashicorp/tap/terraform"
brew "oven-sh/bun/bun"
cask "clash-verge-rev"
cask "claude"
cask "claude-code"
cask "cloudflare-warp"
cask "codex"
cask "comet"
cask "container"
cask "cursor"
cask "discord"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "httpie-desktop"
cask "keepassxc"
cask "obsidian"
cask "openvpn-connect"
cask "outline-manager"
cask "qqmusic"
cask "raycast"
cask "slack"
cask "sublime-text"
cask "tableplus"
cask "telegram"
cask "visual-studio-code"
cask "wechat"
cask "wezterm"
cask "whatsapp"
vscode "anthropic.claude-code"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
