tap "hashicorp/tap"
tap "oven-sh/bun"
brew "cmake"
brew "crane"
brew "cypher-shell"
brew "dos2unix"
brew "gcc"
brew "go"
brew "httpie", link: false
brew "jq"
brew "libfido2"
brew "libidn2"
brew "libpq"
brew "maven"
brew "mysql-client@8.0"
brew "neovim"
brew "node"
brew "ripgrep"
brew "opencode"
brew "poetry"
brew "prettier"
brew "python@3.10"
brew "python@3.12"
brew "telnet"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "tree"
brew "v2ray"
brew "watch"
brew "wget"
brew "wireguard-tools"
brew "hashicorp/tap/terraform"
brew "oven-sh/bun/bun"
cask "antigravity"
cask "chatgpt-atlas"
cask "claude"
cask "claude-code"
cask "clickhouse"
cask "cloudflare-warp"
cask "container"
cask "cursor"
cask "dbeaver-community"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "httpie-desktop"
cask "keepassxc"
cask "obsidian"
cask "openvpn-connect"
cask "outline-manager"
cask "qqmusic"
cask "raycast"
cask "slack"
cask "sublime-text"
cask "telegram"
cask "v2rayu"
cask "visual-studio-code"
cask "wechat"
cask "wezterm"
cask "whatsapp"
cask "windsurf"
cask "zoom"
vscode "alibaba-cloud.tongyi-lingma"
vscode "aminer.codegeex"
vscode "anthropic.claude-code"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
