tap "anomalyco/tap"
tap "hashicorp/tap"
tap "oven-sh/bun"
brew "gemini-cli"
brew "gh"
brew "go"
brew "helm"
brew "tree-sitter"
brew "neovim"
brew "nvm"
brew "prettier"
brew "python@3.13"
brew "python@3.14"
brew "ripgrep"
brew "rtk"
brew "telnet"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "tree"
brew "uv"
brew "v2ray"
brew "wget"
brew "wireguard-tools"
brew "anomalyco/tap/opencode"
brew "hashicorp/tap/terraform"
brew "oven-sh/bun/bun"
cask "clash-verge-rev"
cask "claude-code"
cask "codex"
cask "cursor"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "keepassxc"
cask "obsidian"
cask "openvpn-connect"
cask "qqmusic"
cask "raycast"
cask "slack"
cask "sublime-text"
cask "visual-studio-code"
cask "wechat"
cask "wezterm"
vscode "anthropic.claude-code"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
