tap "anomalyco/tap"
tap "hashicorp/tap"
tap "oven-sh/bun"
brew "python@3.14"
brew "tree"
brew "ansible"
brew "argocd"
brew "cmake"
brew "dos2unix"
brew "gcc"
brew "gh"
brew "go"
brew "helm"
brew "kubernetes-cli"
brew "libfido2"
brew "libidn2"
brew "libpq"
brew "maven"
brew "tree-sitter"
brew "neovim"
brew "nvm"
brew "ripgrep"
brew "rtk"
brew "shellcheck"
brew "sing-box"
brew "telnet"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "tree-sitter-cli"
brew "uv"
brew "watch"
brew "websocat"
brew "wget"
brew "wireguard-tools"
brew "xray"
brew "anomalyco/tap/opencode"
brew "hashicorp/tap/terraform"
brew "oven-sh/bun/bun"
cask "clash-verge-rev"
cask "claude-code"
cask "codex"
cask "container"
cask "cursor"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "httpie-desktop"
cask "keepassxc"
cask "neovide-app"
cask "obsidian"
cask "outline-manager"
cask "raycast"
cask "sfm"
cask "slack"
cask "telegram"
cask "visual-studio-code"
cask "wezterm"
cask "whatsapp"
vscode "anthropic.claude-code"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
go "github.com/grafana/mcp-grafana/cmd/mcp-grafana"
