tap "anomalyco/tap", trusted: true
tap "hashicorp/tap", trusted: true
tap "oven-sh/bun", trusted: true
brew "python@3.14"
brew "tree"
brew "argocd"
brew "awscli"
brew "cmake"
brew "colima"
brew "crane"
brew "docker"
brew "docker-compose"
brew "fzf"
brew "gcc"
brew "gh"
brew "go"
brew "helm"
brew "kubernetes-cli"
brew "libfido2"
brew "libidn2"
brew "libpq"
brew "mysql-client"
brew "tree-sitter"
brew "neovim"
brew "nvm"
brew "ripgrep"
brew "rtk"
brew "shellcheck"
brew "sing-box"
brew "tmux"
brew "tree-sitter-cli"
brew "uv"
brew "watch"
brew "websocat"
brew "wget"
brew "wireguard-tools"
brew "xray"
brew "yq"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode", trusted: true
# Terraform
brew "hashicorp/tap/terraform", trusted: true
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun", trusted: true
cask "alacritty"
cask "chatgpt"
cask "clash-verge-rev"
cask "claude-code"
cask "codex"
cask "cursor"
cask "dbx"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "httpie-desktop"
cask "keepassxc"
cask "neovide-app"
cask "obsidian"
cask "raycast"
cask "session-manager-plugin"
cask "telegram"
cask "visual-studio-code"
cask "wezterm"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
go "github.com/air-verse/air"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/pressly/goose/v3/cmd/goose"
go "github.com/securego/gosec/v2/cmd/gosec"
go "github.com/grafana/mcp-grafana/cmd/mcp-grafana"
go "github.com/swaggo/swag/cmd/swag"
