brew "tree"
brew "argocd"
brew "awscli"
brew "fzf"
brew "gh"
brew "go"
brew "helm"
brew "jq"
brew "kubectl"
brew "mysql-client"
brew "tree-sitter"
brew "neovim"
brew "nvm"
brew "ripgrep"
brew "rtk"
brew "shellcheck"
brew "tmux"
brew "tree-sitter-cli"
brew "uv"
brew "websocat"
brew "xray"
brew "yq"
